/*
Одного разу тамада на весіллі вирішив розважити гостей, і встановив правило:
як тільки приходить новий гість, кожен п'є по одній порції випивки!

Давай допоможемо тамаді порахувати, скільки порцій випивки потрібно приготувати, і напишемо функцію getDrinks.
Вона приймає ціле число numberOfGuests і повертає необхідну кількість порцій випивки,
щоб вистачило усім гостям.

Наприклад, якщо numberOfGuests = 3, то знадобиться:

1 порція, коли прийде перший гість;
ще 2, коли прийде другий;
і ще 3, коли прийде третій.
Всього 1 + 2 + 3 = 6 порцій.
*/

function getDrinks(numberOfGuests) {
  let sum = 0;
  for (let c = 1; c <= numberOfGuests; c++)
      {sum += c;}
  return sum;
  }

  const portion = getDrinks(3);
  console.log('Порцій випивки потрібно приготувати - ', portion);

/*
  Ведучий вирішив трохи змінити правила попередньої розваги.
  Молодята обирають число step, і тепер тост промовляє не кожен гість, а лише перший і кожен наступний,
  який приходить через обрану кількість гостей. Наприклад:
  якщо step = 1, то, як і раніше, тост говорить кожен гість;
  якщо step = 2, то 1-ий, 3-ій, 5-ий ...
  якщо step = 3, то 1, 4, 7, 10 ...
  Напиши функцію getDrinksWithStep, яка приймає numberOfGuests і step та повертає кількість чарок,
  яку треба підготувати для конкурса.
*/

function getDrinksWithStep(numberOfDrinkers, step) {
  let toast = 0;
  for ( let i = 1; i <= numberOfDrinkers; i += step ) {
    toast += i;
  }
  return toast;
}

const conclusion = getDrinksWithStep(10, 3);
console.log('Кількість чарок - ', conclusion);